Mori-Li/My-PDF-Share/STC8H1K08_ICE.c

/*---------------------------------------------------------------------*/
/* ICE风扇,STC8H1K28原方案*/				/*需要改成STC8H1K08*/
/*	引脚分布
		Back EMFADC== P3.6 			|		Back EMFADC == P3.6
			BMF_C 6  == P1.6			|			BMF_W 13  == P3.5	
			BMF_B 9  == P0,1			|			BMF_V 12  == P3.4	
			BMF_A 8  == P0,0			|			BMF_U 11  == P3.3
			Sw ADC7  == P1.7			| 		Sw ADC10  == P3.2
			
			C_PWM3L	 == P1.5			|			W_PWM4N	 == P1.7
			C_PWM3P	 == P1.4			|			W_PWM4P	 == P1.6
			B_PWM2L	 == P1.3			|			V_PWM3N	 == P1.5
			B_PWM2P	 == P1.2			|			V_PWM3P	 == P1.4
			A_PWM1L	 == P1.1			|			U_PWM2N	 == P1.3
			A_PWM1P	 == P1.0			|			U_PWM2P	 == P1.2
			
*/
/*---------------------------------------------------------------------*/

/*************	功能说明	**************

本程序试验使用STC8H1K08-TSSOP20来驱动无传感器无刷三相直流电机.

P1.7 ADC7接的电位器用于设定PWM占空比, 顺时针旋转电位器占空比增加，电机速度升高.
电位器ADC读数转换成0~1023，对应设定占空比0~1023/1024，

******************************************/

#define FOSC		24000000L	//定义主时钟

#include	"STC8Hxxx.h"
#include	"S-Curve.h"
#include	"svpwm-LS.h"

// 电机参数调整：先大致确定参数，然后启动，能启动后，占空比调整到启动占空比，看此时的转速，则启动终了转速比此时转速略小(60~80%)即可。
// 对于惯量较大的负载，小占空比启动，需要更长的启动时间才能强拖到指定的终了速度。过0检测噪声较大时(特别影响低速)，比较器设置回差电压10mV、20mV或30mV。
// 反电动势检测电路使用合适的RC值能滤除干扰，又不会导致明显的相位延时，一般RC值在10us以下。


#define		MOTOR_TYPE	0	//0:2212电机，1：8元风扇单机，2:12万转涵道风扇电机，3:28元全金属涵道风扇


#if	(MOTOR_TYPE == 0)					// 由于退磁时间很短(远小于PWM周期)，则PWM互补输出噪声更低，效率更高。12V供电带大疆9450桨，PWM=312，单端输出0.622A、2846rpm，互补输出0.579A、2902rpm。
	// 1503电机
	#define	MPP					7		// 电机磁极对, Magnetic Pole Pair，8元风扇电机为5对磁极
	#define	ROLL_MinSpeed		200		// 启动时检测到低于这个转速则认为电机停止，从静止开始启动，否则直接进入闭环
	#define	PRE_PWM_DUTY		80		// 预定位占空比, 一般为START_PWM_DUTY的0.5~1，较小的占空比冲击小，但启动力矩小。
	#define	START_PWM_DUTY	100 	// 启动时的占空比
	#define	STOP_PWM_DUTY		50		// 停止PWM，小于此PWM就停机， 根据电机特性适当改变
	#define	BeginSpeed			100		// 启动起始转速，转/分
	#define	FinishSpeed			1000		// 启动终了转速，转/分
	#define	D_StartTime			1000	// 加速时间，单位ms，不能小于500, 500~10922
	#define	PRE_STATE_TIME1		50		// 预定位时间1，ms, 最大值为2849ms
	#define	PRE_STATE_TIME2		35		// 预定位时间2，ms, 最大值为2849ms
	#define	PRE_STATE_TIME3		20		// 预定位时间3，ms, 最大值为2849ms

#endif

#define CONTEMPRATY 	1 		//  1:使用互补PWM， 0:使用单端PWM

/*改改*/
//sbit U_PWM2P = P1^0;		//原K28参数
//sbit U_PWM2N = P1^1;
//sbit V_PWM3P = P1^2;
//sbit V_PWM3N = P1^3;
//sbit W_PWM4P = P1^4;
//sbit W_PWM4N = P1^5;
sbit U_PWM2P = P1^2;			//K08参数
sbit U_PWM2N = P1^3;
sbit V_PWM3P = P1^4;
sbit V_PWM3N = P1^5;
sbit W_PWM4P = P1^6;
sbit W_PWM4N = P1^7;

/*改改*/
//sbit P_LED  = P2^3;	//LED指示灯
//sbit P_TEST = P3^7;	//测试脚
//sbit P_PPM  = P3^3;	//测试脚
sbit LED_S  	= P3^7;	//LED指示灯
//sbit TP2 		 	= P1^0;	//测试脚
//sbit TP1  		= P1^1;	//测试脚


typedef enum
{
	MOTOR_IDLE = 0,		//停止、空闲
	ROLL_CHECK,			//转动检测
	PRE_POSITION,		//预定位
	STARTING,			//启动
	MOTOR_RUN			//运行, 这个不能有逗号
} runFlagType;
runFlagType run_mode;

u8	fs_cnt = 0;			// 启动电机处理频率，对PWM周期计数，得到大约1000Hz的频率
u32	roll_N    = 0;		// 电机速度递增步进
u16	roll_sum  = 0;		// 调速累加器
u16	SartCnt = 0;		// 启动处理次数(采样周期)计数
u16	StartTime;			// 启动时间, 用户指定启动时间折算成采样周期(大约1ms)的个数，
u16 angle   = 0;		//当前转子电角度
u16 Ua, Ub, Uc;			//3 相PWM
u8	RollCheckIndex;		//转动检测索引
u16	RollPahseTimeUV;	//转动换相检测时间


u8	cmpo_state;		//PWMA中断-比较器连续8个输出状态
bit	B_pre_cmpo;		//上一个比较器输出电平
bit	B_cmpo;			//比较器有效输出电平（CMPO 8连1则为，8连0则为0）

u8	step;		//切换步骤
u16	PWM_Value;	//PWM占空比的值
u16	PWW_Set;	//目标PWM设置
bit	B_1ms;		//1ms定时标志
bit	B_4ms;		//4ms定时标志
u8	cnt_4ms;
u8	cnt_500ms;
bit	B_500ms;

u16	Sw_ADC10;				//Switch --->> Mori 单刀 P3.2  梁工原adc11
u16	Vbat;			//电池电压
u16	Current;		//电流

u8	TimeOut;	//堵转超时
bit	B_Timer3_OverFlow;

u8	PhaseTimeIndex;		//换相时间保存索引
u16	PhaseTimeTmp[4];	//4个换相时间缓存
u16	PhaseTime4sum;		//4次换相时间累加和, 用于中间计算
u16	PhaseTime;			//换相时间
u8	XiaoCiCnt;			//1:需要消磁(30度角延时), 2:正在消磁, 0已经消磁


u32	PhaseTimeSum;	//换相时间累加和，计算速度累加换相时间
u16	PhaseSumCnt;	//换相累加次数，用于计算转速
u32	RollSpeed;		//转速


/*************************/

void  delay_ms(unsigned int ms)
{
	unsigned int i;
	do
	{
		i = (FOSC+5000) / 10000UL;
		while(--i)	;
	}while(--ms);
}


void delay_us(u8 us)	//N us延时函数
{
	do
	{
		NOP(17);	//@24MHz
	}
	while(--us);
}

void  delay_N_10us(unsigned int j)
{
	unsigned char i;
	do
	{
		i = (FOSC + 150000UL) / 300000UL -4;
		_nop_();
		_nop_();
		while(--i)	;
	}while(--j);
}


void	Delay_500ns(void)
{
	NOP(6);
}


/************************ 比较器初始化函数 ****************************/
// 截止2025-6-2，旧版型号：STC8H1K08系列、STC8H1K28系列、STC8H3K64S2系列、STC8H3K64S4系列。
// 旧版的CMP+只能切换P3.7或ADC输入，不支持寄存器CMPEXCFG。
void	CMP_config(void)
{
	P_SW2 |= 0x80;		//SFR enable
	CMPCR1 = 0;
	CMPCR2 = 60;		//比较结果变化延时周期数, 0~63

	CMPCR1 |= (1<<7);	//1: 允许比较器,     0:关闭比较器
	CMPCR1 |= (0<<5);	//1: 允许上升沿中断, 0: 禁止
	CMPCR1 |= (0<<4);	//1: 允许下降沿中断, 0: 禁止
	CMPCR1 |= (1<<3);	//输入正极性选择, 0: 选择外部P3.7做正输入,    1: 由ADC_CHS[3:0]所选择的ADC输入端做正输入.
	CMPCR1 |= (1<<2);	//输入负极性选择, 0: 选择内部BandGap电压BGv做负输入, 1: 选择外部P3.6做输入
	CMPCR1 |= (0<<1);	//1: 允许比较结果输出到IO(P3.4或P4.1),  0: 比较结果禁止输出到IO

	CMPCR2 |= (0<<7);	//1: 比较器结果输出IO取反, 0: 不取反
	CMPCR2 |= (0<<6);	//0: 允许内部0.1uF滤波,    1: 关闭

	P3n_pure_input(0x7c);	//设置P3.6-CMP-为高阻输入
												//将输入的ADC通道设置为高阻,  P3.3--BMF_U, ，
																							//			P3.4--BMF_V
																								//		P3.5--BMF_W,
																									//	P3.2--Sw_adc
	ADC_CONTR = 0x80 + 8;	//打开ADC，选择ADC通道0~14
}



#define ADC_START	(1<<6)	/* 自动清0 */
#define ADC_FLAG	(1<<5)	/* 软件清0 */

#define	ADC_SPEED	3		/* 0~15, ADC时钟 = SYSclk/2/(n+1) */
#define	RES_FMT		(1<<5)	/* ADC结果格式 0: 左对齐, ADC_RES: D9 D8 D7 D6 D5 D4 D3 D2, ADC_RESL: D1 D0 0  0  0  0  0  0 */
							/*             1: 右对齐, ADC_RES: 0  0  0  0  0  0  D9 D8, ADC_RESL: D7 D6 D5 D4 D3 D2 D1 D0 */

#define CSSETUP		(1<<7)	/* 0~1,  ADC通道选择时间      0: 1个ADC时钟, 1: 2个ADC时钟,  默认0(默认1个ADC时钟) */
#define CSHOLD		(1<<5)	/* 0~3,  ADC通道选择保持时间  (n+1)个ADC时钟, 默认1(默认2个ADC时钟)                */
#define SMPDUTY		11		/* 10~31, ADC模拟信号采样时间  (n+1)个ADC时钟, 默认10(默认11个ADC时钟)				*/
							/* ADC转换时间: 10位ADC固定为10个ADC时钟, 12位ADC固定为12个ADC时钟. 				*/

void ADC_config(void)	//ADC初始化函数(为了使用ADC输入端做比较器信号, 实际没有启动ADC转换)
{
	P_SW2 |=  0x80;	//访问XSFR
	P3n_pure_input(Pin2);	//设置为高阻输入, P3.2--ADC10--滑动变阻器VR
	ADC_CONTR = 0x80 + 10;	//ADC on + ADC channel=10=P3.2
	ADCCFG = RES_FMT + ADC_SPEED;
	ADCTIM = CSSETUP + CSHOLD + SMPDUTY;
	EADC = 0;			//禁止ADC中断
}


