Mori-Li/My-PDF-Share/STC8H1K08_ICE.c
//========================================================================
// 函数: u16	Get_ADC10bitResult(u8 channel))	//channel = 0~15
//========================================================================
u16	Get_ADC10bitResult(u8 channel)	//channel = 0~15
{
	u8 i;
	ADC_RES = 0;
	ADC_RESL = 0;
	ADC_CONTR = 0x80 | ADC_START | channel;
	NOP(5);			//
//	while((ADC_CONTR & ADC_FLAG) == 0)	;	//等待ADC结束
		i = 255;
		while(i != 0)	//超时处理
		{
			i--;
			if((ADC_CONTR & ADC_FLAG) != 0)	break;	//等待ADC结束
		}
	ADC_CONTR &= ~ADC_FLAG;
	return	((u16)ADC_RES * 256 + (u16)ADC_RESL);
}



/*******************************
UV表示A加载PWM，B接GND，C↓表示W相反电动势下降沿，C↑表示W相反电动势上升沿。两个转向的时序是，换相顺序相反，反电动势相反。
拍序   逆时针    
 0     UV, W↓              A
 1     UW, V↑            B   C
 2     VW, U↓    
 3     VU, W↑    
 4     WU, V↓    
 5     WV, U↑    

*******************************/


#define 	BMF_U 	11		// ADC通道11--P3.3
#define 	BMF_V 	12	  // ADC通道12--P3.4
#define 	BMF_W 	13 		// ADC通道13--P3.5		 似乎要改两处 1 CMP高阻设置 : 2 ADC_CONRT 寄存器值

void StepMotor(void) // 换相序列函数
{
	if(++step >= 6)	step = 0;
//P33 = ~P33;	//换相指示

	switch(step)
	{
	case 0:  // UV  U_PWM2P=pwm, PWM3_N=1
			PWMA_ENO = 0x00;	U_PWM2N=0;	W_PWM4N=0;
			Delay_500ns();
			PWMA_ENO = 0x04+0x08*CONTEMPRATY;					// 打开U相的高端PWM,	PWMA_ENO输出开启寄存器,U相PWM2P对应 0x04+0x08 
			V_PWM3N = 1;			// 打开V相的低端
			ADC_CONTR = 0x80+BMF_W;	// 选择P3.5作为ADC输入 即W相电压
			break;
	case 1:  // UW  U_PWM2P=pwm, PWM4_N=1
			PWMA_ENO = 0x00;	U_PWM2N=0;	V_PWM3N=0;	
			Delay_500ns();
			PWMA_ENO = 0x04+0x08*CONTEMPRATY;					// 打开U相的高端PWM
			W_PWM4N = 1;			// 打开W相的低端
			ADC_CONTR = 0x80+BMF_V;	// 选择P3.4作为ADC输入 即V相电压
			break;
	case 2:  // VW  V_PWM3P=pwm, PWM4_N=1
			PWMA_ENO = 0x00;	U_PWM2N=0;	V_PWM3N=0;
			Delay_500ns();
			PWMA_ENO = 0x10+0x20*CONTEMPRATY;					// 打开V相的高端PWM
			W_PWM4N = 1;			// 打开W相的低端
			Sw_ADC10  = ((Sw_ADC10  *7)>>3) + Get_ADC10bitResult(10);	//低通滤波结果为13位,   6: ADC8(电流), 7：ADC9(电压)，11：ADC11(电位器)
			ADC_CONTR = 0x80+BMF_U;	// 选择P3.3作为ADC输入 即U相电压
			break;
	case 3:  // VU  V_PWM3P=pwm, PWM2_N=1
			PWMA_ENO = 0x00;	V_PWM3N=0;	W_PWM4N=0;	
			Delay_500ns();
			PWMA_ENO = 0x10+0x20*CONTEMPRATY;					// 打开V相的高端PWM
			U_PWM2N = 1;			// 打开U相的低端
			ADC_CONTR = 0x80+BMF_W;	// 选择P3.5作为ADC输入 即W相电压
			break;
	case 4:  // WU  W_PWM4P=pwm, PWM2_N=1
			PWMA_ENO = 0x00;	V_PWM3N=0;	W_PWM4N=0;
			Delay_500ns();
			PWMA_ENO = 0x40+0x80*CONTEMPRATY;					// 打开W相的高端PWM
			U_PWM2N = 1;			// 打开U相的低端
			
			ADC_CONTR = 0x80+BMF_V;	// 选择P3.4作为ADC输入 即V相电压
			break;
	case 5:  // WV  W_PWM4P=pwm, PWM3_N=1
			PWMA_ENO = 0x00;	U_PWM2N=0;	W_PWM4N=0;
			Delay_500ns();
			PWMA_ENO = 0x40+0x80*CONTEMPRATY;					// 打开W相的高端PWM
			V_PWM3N = 1;			// 打开V相的低端
			ADC_CONTR = 0x80+BMF_U;	// 选择P3.3作为ADC输入 即U相电压
			break;

	default:
			break;
	}
}


void PWMA_config(void)
{
	P_SW2 |= 0x80;		//SFR enable

	U_PWM2P = 0;
	U_PWM2N = 0;
	V_PWM3P = 0;
	V_PWM3N = 0;
	W_PWM4P = 0;
	W_PWM4N = 0;
	P1n_push_pull(0x3f);

	PWMA_PSCR = 0;		// 预分频寄存器, 分频 Fck_cnt = Fck_psc/(PSCR[15:0}+1), 边沿对齐PWM频率 = SYSclk/((PSCR+1)*(AAR+1)), 中央对齐PWM频率 = SYSclk/((PSCR+1)*(AAR+1)*2).
	PWMA_DTR  = 12;		// 死区时间配置, n=0~127: DTR= n T,   0x80 ~(0x80+n), n=0~63: DTR=(64+n)*2T,
						//				0xc0 ~(0xc0+n), n=0~31: DTR=(32+n)*8T,   0xE0 ~(0xE0+n), n=0~31: DTR=(32+n)*16T,
	PWMA_ARR    = 1023;	// 自动重装载寄存器,  控制PWM周期
	PWMA_CCER1  = 0;
	PWMA_CCER2  = 0;
	PWMA_SR1    = 0;
	PWMA_SR2    = 0;
	PWMA_ENO    = 0;
	PWMA_PS     = 0;
	PWMA_IER    = 0;
//	PWMA_ISR_En = 0;

//	PWMA_IER   |= 0x01;		// 使能更新中断

/*	PWMA_CCMR1  = 0x68;		// 通道模式配置, PWM模式1, 预装载允许
	PWMA_CCR1   = 0;		// 比较值, 控制占空比(高电平时钟数)
	PWMA_CCER1 |= 0x05;		// 开启比较输出, 高电平有效
	PWMA_PS    |= 0;		// 选择IO, 0:选择P1.0 P1.1, 1:选择P2.0 P2.1, 2:选择P6.0 P6.1,
	PWMA_CCMR1  = 0x68;		// 通道模式配置, PWM模式1, 预装载允许
//	PWMA_ENO   |= 0x01;		// IO输出允许,  bit7: ENO4N, bit6: ENO4P, bit5: ENO3N, bit4: ENO3P,  bit3: ENO2N,  bit2: ENO2P,  bit1: ENO1N,  bit0: ENO1P
//	PWMA_IER   |= 0x02;		// 使能PWM1中断             */

	PWMA_CCMR2  = 0x68;		// 通道模式配置, PWM模式1, 预装载允许
	PWMA_CCR2   = 0;		// 比较值, 控制占空比(高电平时钟数)
	PWMA_CCER1 |= 0x50;		// 开启比较输出, 高电平有效
	PWMA_PS    |= (0<<2);	// 选择IO, 0:选择P1.2 P1.3, 1:选择P2.2 P2.3, 2:选择P6.2 P6.3,
	PWMA_CCMR2  = 0x68;		// 通道模式配置, PWM模式1, 预装载允许
//	PWMA_ENO   |= 0x04;		// IO输出允许,  bit7: ENO4N, bit6: ENO4P, bit5: ENO3N, bit4: ENO3P,  bit3: ENO2N,  bit2: ENO2P,  bit1: ENO1N,  bit0: ENO1P
//	PWMA_IER   |= 0x04;		// 使能PWM2中断

	PWMA_CCMR3  = 0x68;		// 通道模式配置, PWM模式1, 预装载允许
	PWMA_CCR3   = 0;		// 比较值, 控制占空比(高电平时钟数)
	PWMA_CCER2 |= 0x05;		// 开启比较输出, 高电平有效
	PWMA_PS    |= (0<<4);	// 选择IO, 0:选择P1.4 P1.5, 1:选择P2.4 P2.5, 2:选择P6.4 P6.5,
	PWMA_CCMR3  = 0x68;		// 通道模式配置, PWM模式1, 预装载允许
//	PWMA_ENO   |= 0x10;		// IO输出允许,  bit7: ENO4N, bit6: ENO4P, bit5: ENO3N, bit4: ENO3P,  bit3: ENO2N,  bit2: ENO2P,  bit1: ENO1N,  bit0: ENO1P
//	PWMA_IER   |= 0x08;		// 使能PWM3中断

  PWMA_CCMR4  = 0x68;		// 通道模式配置, PWM模式1, 预装载允许
	PWMA_CCR4   = 0;		// 比较值, 控制占空比(高电平时钟数)
  PWMA_CCER2 |= 0x50;		// 开启比较输出, 高电平有效
	PWMA_PS    |= (0<<6);	// 选择IO, 0:选择P1.6 P1.7, 1:选择P2.6 P2.7, 2:选择P6.6 P6.7,
  PWMA_CCMR4  = 0x68;		// 通道模式配置, PWM模式1, 预装载允许
//	PWMA_ENO   |= 0x40;		// IO输出允许,  bit7: ENO4N, bit6: ENO4P, bit5: ENO3N, bit4: ENO3P,  bit3: ENO2N,  bit2: ENO2P,  bit1: ENO1N,  bit0: ENO1P
//	PWMA_IER   |= 0x10;		// 使能PWM4中断

	PWMA_BKR    = 0x80;		// 主输出使能 相当于总开关
	PWMA_CR1    = 0x81;		// 使能计数器, 允许自动重装载寄存器缓冲, 边沿对齐模式, 向上计数,  bit7=1:写自动重装载寄存器缓冲(本周期不会被打扰), =0:直接写自动重装载寄存器本(周期可能会乱掉)
	PWMA_EGR    = 0x01;		//产生一次更新事件, 清除计数器和与分频计数器, 装载预分频寄存器的值
//	PWMA_ISR_En = PWMA_IER;	//设置标志允许通道1~4中断处理
}

//	PWMA_PS   = (0<<6)+(0<<4)+(0<<2)+0;	//选择IO, 4项从高到低(从左到右)对应PWM1 PWM2 PWM3 PWM4, 0:选择P1.x, 1:选择P2.x, 2:选择P6.x,
//  PWMA_PS    PWM4N PWM4P    PWM3N PWM3P    PWM2N PWM2P    PWM1N PWM1P
//    00       P1.7  P1.6     P1.5  P1.4     P1.3  P5.4     P1.1  P1.0
//    01       P2.7  P2.6     P2.5  P2.4     P2.3  P2.2     P2.1  P2.0
//    02       P6.7  P6.6     P6.5  P6.4     P6.3  P6.2     P6.1  P6.0
//    03       P3.3  P3.4      --    --       --    --       --    --



