Mori-Li/My-PDF-Share/STC8H1K08_ICE.c
#define		PHASE_TIME_MAX	16380		//最大换相时间, us, 避免累加和溢出

void CMP_ISR(void) interrupt CMP_VECTOR		//比较器中断函数, 检测到反电动势过0事件
{
	u8	i;
	CMPCR1 &= ~(0x40+0x30);	// 软件清除中断标志位, 禁止比较器上升沿、下降沿中断中断

	if(XiaoCiCnt == 0)	//消磁后才检测过0事件,   XiaoCiCnt=1:需要消磁(30度角延时), =2:正在消磁, =0已经消磁
	{
		T4T3M &= ~(1<<3);	// Timer3停止运行
		PhaseTime = ((u16)T3H << 8) + T3L;	//读取Timer3测量到的换相时间(单位1us)
		T3H = 0;	T3L = 0;
		T4T3M |=  (1<<3);	//Timer3开始运行

		if(B_Timer3_OverFlow)	//切换时间间隔(Timer3)有溢出
		{
			B_Timer3_OverFlow = 0;
			PhaseTime = PHASE_TIME_MAX;	//换相时间最大8ms, 2212电机12V空转最高速130us切换一相(200RPS 12000RPM), 480mA
		}
		else if(PhaseTime >= PHASE_TIME_MAX)	PhaseTime = PHASE_TIME_MAX;	//换相时间最大8ms, 2212电机12V空转最高速130us切换一相(200RPS 12000RPM), 480mA

		PhaseTimeTmp[PhaseTimeIndex] = PhaseTime;	//保存本次换相时间
		if(++PhaseTimeIndex >= 4)	PhaseTimeIndex = 0;	//索引溢出归0
		for(PhaseTime4sum=0, i=0; i<4; i++)	PhaseTime4sum += PhaseTimeTmp[i];	//求8次换相时间累加和, 用于计算实时转速 = 1/(M*PhaseTime8sum*3/4) 转/秒 = 60/(M*PhaseTime8sum*3/4) 转/分，PhaseTime8sum*3/4为换相6次的时间，M为磁极对。
		PhaseTime = PhaseTime4sum >> 2;		//求8次换相时间的平均值
		//if(PhaseTime >= 80)	TimeOut = 125;	//堵转500ms超时

		T4T3M &= ~(1<<7);				//Timer4停止运行
		PhaseTime4sum = 0 - PhaseTime;		//Timer4 1us 2个计数
		T4H = (u8)(PhaseTime4sum >> 8);		//装载30度角延时
		T4L = (u8)PhaseTime4sum;
		T4T3M |=  (1<<7);	//Timer4开始运行
		XiaoCiCnt = 1;		//1:需要消磁(30度角延时), 2:正在消磁, 0已经消磁
	}
}

//============================ timer0初始化函数 ============================================
void Timer0_config(void)	//Timer0初始化函数, 用于产生1ms时隙
{
	Timer0_16bitAutoReload(); // T0工作于16位自动重装
	Timer0_1T();
	TH0 = (65536UL-FOSC/1000) / 256; //1ms
	TL0 = (65536UL-FOSC/1000) % 256;
	TR0 = 1; // 打开定时器0

	ET0 = 1;// 允许ET0中断
}
//=========================== timer0中断函数 =============================================
void Timer0_ISR(void) interrupt TIMER0_VECTOR	//Timer0中断函数, 用于产生1ms时隙
{
	B_1ms = 1;	//1ms定时标志
}

//============================ timer3初始化函数 ============================================
void	Timer3_Config(void)	//测量换相时间
{
	T4T3M &= 0xf0;		//停止计数, 定时模式, 12T模式, 不输出时钟
	T3H = 0;
	T3L = 0;
	TM3PS  = 1;			//预分频，获得更宽的测量范围, FOSC/12/2=1MHz
	IE2   |=  (1<<5);	//允许中断
//	T4T3M |=  (1<<3);	//开始运行
}

//=========================== timer3中断函数 =============================================
void timer3_ISR(void) interrupt TIMER3_VECTOR	//测量换相时间
{
	B_Timer3_OverFlow = 1;	//溢出标志
}

//============================ timer4初始化函数 ============================================
void	Timer4_Config(void)		//换相时间30度角延时以及退磁时间
{
	T4T3M &= 0x0f;		//停止计数, 定时模式, 12T模式, 不输出时钟
	T4H = 0;
	T4L = 0;
	IE2   |=  (1<<6);	//允许中断
//	T4T3M |=  (1<<7);	//开始运行
}

//=========================== timer4中断函数 =============================================
void timer4_ISR(void) interrupt TIMER4_VECTOR		//换相时间30度角延时以及退磁时间
{
	T4T3M &= ~(1<<7);		//Timer4停止运行
	if(XiaoCiCnt == 1)		//标记需要消磁. 每次检测到过0事件后第一次中断为30度角延时, 设置消磁延时.   1:需要消磁(30度角延时), 2:正在消磁, 0已经消磁
	{
		XiaoCiCnt = 2;		//1:需要消磁(30度角延时), 2:正在消磁, 0已经消磁
		if(run_mode == MOTOR_RUN)	StepMotor();	//电机正在运行, 则换相

										//消磁时间, 换相后线圈(电感)电流减小到0的过程中, 出现反电动势, 电流越大消磁时间越长, 过0检测要在这个时间之后
										//100%占空比时施加较重负载, 电机电流上升, 可以示波器看消磁时间.
										//实际上, 只要在换相后延时几十us才检测过零, 就可以了
		T4H = (u8)((65536UL - 10*2) >> 8);	//装载消磁延时, 避开刚换相时电机线圈电感的反电动势出现那一刻。
		T4L = (u8)( 65536UL - 10*2);
		T4T3M |=  (1<<7);	//Timer4开始运行
	}
	else if(XiaoCiCnt == 2)
	{
		XiaoCiCnt = 0;	//1:需要消磁(30度角延时), 2:正在消磁, 0已经消磁

		CMPCR1 &= ~(0x40+0x30);	// 软件清除中断标志位, 禁止比较器上升沿、下降沿中断中断
		if(step & 1)	CMPCR1 |= (1<<5);	//1: 允许上升沿中断, 0: 禁止
		else			CMPCR1 |= (1<<4);	//1: 允许下降沿中断, 0: 禁止
	}
}

u8	adc_index;
void	AdcConvert(void)
{			
		Sw_ADC10 = ((Sw_ADC10 *7)>>3) + Get_ADC10bitResult(10);	//低通滤波结果为13位,   10：ADC10(电位器)
}

void	LoadPwm(void)
{
	Ua = (u16)((((long)svpwm_dat[angle]             *PWM_Value)>>10)+512);	//计算U相占空比
	Ub = (u16)((((long)svpwm_dat[(angle -1365)%4096]*PWM_Value)>>10)+512);	//计算V相占空比, 比U相滞后120度
	Uc = (u16)((((long)svpwm_dat[(angle -2730)%4096]*PWM_Value)>>10)+512);	//计算W相占空比, 比U相滞后240度
	PWMA_CCR1 = Ua;
	PWMA_CCR2 = Ub;
	PWMA_CCR3 = Uc;
}


#if ((ROLL_MinSpeed*MPP) < 22)
	#error "ROLL_MinSpeed*MPP 乘稷要大于等于22!"
#else
#define	ROLL_MaxTime	((23437UL*60/ROLL_MinSpeed)/MPP)	//停转电周期时间 = (60/ROLL_MinSpeed/MPP)*1000*23.4375, ROLL_MinSpeed*MPP >=22
#endif

void PWMA_ISR(void) interrupt PWMA_VECTOR // 23.4375KHz（42.67us）中断率，用于处理启动电机，查询读取比较器结果
{
	u8 i;

	B_pre_cmpo = B_cmpo;	//保存上一个输出电平
	cmpo_state = (cmpo_state << 1) | (CMPCR1 & 1);	// 读取比较器状态，放在一个字节中, 连续8次检测到相同电平才认为有效
	if(cmpo_state == 0xff)	B_cmpo  = 1;	//连续8个采样为1, 则比较器输出1
	if(cmpo_state == 0x00)	B_cmpo  = 0;	//连续8个采样为0, 则比较器输出0

				//============================ 转动检测 =========================================
	if(run_mode == ROLL_CHECK)	//转动检测
	{
		if(++StartTime >= ROLL_MaxTime)	//超时未检测到转动，  ROLL_MaxTime 最大值为2849ms
		{
			StartTime = 0;
			SartCnt   = 0;
			V_PWM3N = 0;	W_PWM4N = 0;
			RollCheckIndex = 0;
			run_mode = PRE_POSITION;
		}
		else if(RollCheckIndex == 0)	//设置U相下降沿
		{
			ADC_CONTR = 0x80+BMF_U;	// 比较器CMP+选择U相
			StartTime = 0;
			PWMA_ENO  = 0;	U_PWM2P = 0;	U_PWM2N = 0;	V_PWM3P = 0;	V_PWM3N = 0;	W_PWM4P = 0;	W_PWM4N = 0;	//关闭PWM输出, 自由转动
			cmpo_state = 0x00;	B_cmpo  = 0;	//连续8个采样为0, 则比较器输出0
			RollCheckIndex = 1;
		}
		else if(RollCheckIndex == 1)	//等待U相下降沿
		{
			if(B_pre_cmpo && !B_cmpo)	//下降沿出现
			{
				ADC_CONTR = 0x80+BMF_V;	// 比较器CMP+选择V相
				StartTime = 0;
				cmpo_state = 0xFF;	B_cmpo  = 1;	//连续8个采样为1, 则比较器输出1
				RollCheckIndex = 2;
			}
		}
		else if(RollCheckIndex == 2)	//等待V相上升沿
		{
			if(!B_pre_cmpo && B_cmpo)	//上升沿出现
			{
				RollPahseTimeUV = StartTime;	//U相下降沿与V相上升沿时间
				StartTime = 0;
				ADC_CONTR = 0x80+BMF_U;	// 比较器CMP+选择U相
				cmpo_state = 0x00;	B_cmpo  = 0;	//连续8个采样为0, 则比较器输出0
				RollCheckIndex = 3;
			}
		}
		else if(RollCheckIndex == 3)	//等待U相下降沿
		{
			if(B_pre_cmpo && !B_cmpo)	//下降沿出现
			{
				StartTime = (StartTime + RollPahseTimeUV)/2;	//半个周期(3个换相时间)
				if(RollPahseTimeUV < StartTime)	//顺时针
				{
					V_PWM3N = 1;	W_PWM4N = 1;	//刹车
					StartTime = 0;
					RollCheckIndex = 4;
				}
				else	//逆时针
				{
					T4T3M &= ~(1<<3);	// Timer3停止运行
					T3H = 0;	T3L = 0;
					B_Timer3_OverFlow = 0;
					T4T3M |=  (1<<3);	//Timer3开始运行
					XiaoCiCnt = 0;	//消磁

					PhaseTime = StartTime *14;	//半个周期(3个换相时间)换相时间折算成us, PhaseTime = (StartTime/3) *42.667;
					for(i=0; i<4; i++)	PhaseTimeTmp[i] = PhaseTime;	//初始换相时间
					delay_N_10us(PhaseTime/20-34);	//30度角延时=PhaseTime/2/10, -34为修正8次采样时间340us
					step = 2;
					StepMotor();	//换相(对应U相反电动势下降沿)

					TimeOut = 200;	//堵转超时
					PWM_Value = START_PWM_DUTY;
					PWMA_IER = 0;	//如果电机已启动运行，则禁止PWMA中断
					run_mode = MOTOR_RUN;

					delay_us(50);
					CMPCR1 &= ~(0x40+0x30);	// 软件清除中断标志位, 禁止比较器上升沿、下降沿中断中断
					if(step & 1)	CMPCR1 |= (1<<5);	//1: 允许上升沿中断, 0: 禁止
					else			CMPCR1 |= (1<<4);	//1: 允许下降沿中断, 0: 禁止
				}
			}
		}
		else if(RollCheckIndex == 4)	//等待U相下降沿, 直到检测不到则停止
		{
			if(B_pre_cmpo && !B_cmpo)	//下降沿出现
			{
				StartTime = 0;
			}
		}
	}
				//============================ 预定位模式 =========================================
	else if(run_mode == PRE_POSITION)	//预定位模式
	{
		if(RollCheckIndex == 0)
		{
			CMPCR1 &= ~(0x40+0x30);	// 软件清除中断标志位, 禁止比较器上升沿、下降沿中断中断
			PWMA_ENO  = 0x3f;			// 全部打开PWM输出
			PWM_Value = PRE_PWM_DUTY;	// 设置预定位占空比
			SartCnt = 0;
			angle = 4096-680;
			LoadPwm();
			RollCheckIndex = 1;
		}
		else if(RollCheckIndex == 1)
		{
			if(++SartCnt == (PRE_STATE_TIME1*23))	//预定位1时间到, PRE_STATE_TIME1最大值为2849ms
			{
				SartCnt = 0;
				angle = 4096-340;
				LoadPwm();
				RollCheckIndex = 2;
			}
		}
		else if(RollCheckIndex == 2)
		{
			if(++SartCnt == (PRE_STATE_TIME2*23))	//预定位2时间到, PRE_STATE_TIME2最大值为2849ms
			{
				SartCnt = 0;
				angle = 0;
				LoadPwm();
				RollCheckIndex = 3;
			}
		}
		else if(RollCheckIndex == 3)
		{
			if(++SartCnt == (PRE_STATE_TIME3*23))	//预定位3时间到, PRE_STATE_TIME3最大值为2849ms
			{
				StartTime = D_StartTime*6;	//StartTime=t*1000/(1024*4/24)=t*375/64=t*6步
				roll_sum  = 0;
				roll_N    = 0;
				SartCnt  = 0;
				PWM_Value = START_PWM_DUTY;	// 设置启动占空比
				run_mode  = STARTING;
			}
		}
		AdcConvert();
	}

				//============================ 启动模式 =========================================
	else if(run_mode == STARTING)	//启动模式, 使用查表S曲线加速启动
	{
		if(++fs_cnt == 4)	// 使用256点的S曲线表，初速V1(转/分)，终速V2(转/分)，加速时间t(ms)，fs=24000000/1024/4 = 46875 /8 = 5859Hz，则加速总步数StartTime = t/1000*fs = t*1000/(1024*4/24) = t*375/64=t*6步
		{					// 查表步进 = 65536/StartTime, 步数SartCnt每次+1，查表得到速度系数 du=S_Curve[SartCnt*65536/StartTime/256] = S_Curve[SartCnt*256/StartTime], 当前速度 V = V1 + (V2-V1)*du/1024 (转/秒)
			fs_cnt = 0;		// 采样频率fs，16位累加器roll_sum，磁极对MPP，则电机转速 V=60*fs*roll_N/roll_sum/MPP, 转速步进 roll_N = V*MPP*sum/60/fs = V*MPP*65536/60/5859 = 0.1864*V*MPP = V*MPP*191/1024

			SartCnt++;
			if(SartCnt < StartTime)
			{
				roll_N = BeginSpeed + (u16)(((u32)S_Curve[(u8)((u32)SartCnt*256/StartTime)] *(FinishSpeed - BeginSpeed))/1024);	//当前速度 V = V1 + (V2-V1)*du/1024 = V1 + (V2-V1)*S_Curve[SartCnt*256/StartTime]/1024  (转/秒)
				roll_sum += (u16)(((u32)roll_N*MPP*191) >>10);	// 当前速度 = V*MPP*191/1024

				angle = (roll_sum >> 4);	//roll_sum是16位的，SVPWM表长度为12位
				LoadPwm();
			}
			else 	//强拖结束
			{
				PWMA_ENO   = 0;
				U_PWM2P=0;	V_PWM3P=0;	W_PWM4P=0;
				U_PWM2N=0;	V_PWM3N=0;	W_PWM4N=0;

				StartTime = 0;
				RollCheckIndex = 0;
				run_mode = ROLL_CHECK;	//进入转动检测模式
			}
		}
		AdcConvert();
	}

