Mori-Li/My-PDF-Share/STC8H1K08_ICE.c
    PWMA_SR1 = 0;	//清除标志
}


/**********************************************/
void main(void)
{
	u8	i;
	u16	j;

	P2n_standard(0x08);
	P3n_standard(0x80);  //LED_init 3.7

	Sw_ADC10 = 0;

	PWMA_config();
	ADC_config();
	CMP_config();
	Timer0_config();	// Timer0初始化函数, 系统节拍
	Timer3_Config();	// Timer3初始化函数，换相时间检测
	Timer4_Config();	// Timer4初始化函数，换相时间控制
	PWW_Set = 0;
	TimeOut = 0;
	PhaseTimeIndex = 0;
	//run_mode = MOTOR_IDLE;
	run_mode = PRE_POSITION;  // 跳过IDLE/ROLL_CHECK，直接预定位

	EA  = 1; // 打开总中断

	cnt_4ms = 0;


	while (1)
	{
		if(B_1ms)		// 1ms时隙
		{
			B_1ms = 0;
			if(++cnt_4ms == 4)
			{
				cnt_4ms = 0;
				B_4ms   = 1;	//4ms时隙标志
			}

			if(run_mode == MOTOR_RUN)	//电机正在运行
			{
				PhaseTimeSum += PhaseTime;		// PhaseTime为换相时间
				PhaseSumCnt++;

				i = 0;
				if(PWM_Value < PWW_Set)	i = 1, PWM_Value++;	//油门跟随电位器
				if(PWM_Value > PWW_Set)	i = 1, PWM_Value--;
				if(i != 0)
				{
					PWMA_CCR1 = PWM_Value;
					PWMA_CCR2 = PWM_Value;
					PWMA_CCR3 = PWM_Value;
				}
			}

			if(run_mode == MOTOR_IDLE)	//如果是停机模式，占空比大于设定值, 则开始预定位、启动电机
			{
				if(PWW_Set >= START_PWM_DUTY)
				{
					LED_S = 0;		//LED指示灯亮
					PWMA_SR1 = 0;	//清除PWMA中断标志
					StartTime = 0;
					RollCheckIndex = 0;
					run_mode = ROLL_CHECK;	//进入转动检测模式
					PWMA_IER = 0x01;	// 使能更新中断
				}
			}
			else if(PWW_Set < STOP_PWM_DUTY)	// 非空闲模式，PWM过小停转
			{
				PWMA_IER  = 0;	//如果电机已启动运行，则禁止PWMA中断
				PWM_Value = 0;
				CMPCR1 &= ~(0x40+0x30);	// 软件清除中断标志位, 禁止比较器上升沿、下降沿中断中断
				PWMA_ENO   = 0;
				PWMA_CCR1 = 0;
				PWMA_CCR2 = 0;
				PWMA_CCR3 = 0;
				U_PWM2P=0;	V_PWM3P=0;	W_PWM4P=0;
				U_PWM2N=0;	V_PWM3N=0;	W_PWM4N=0;
				run_mode = MOTOR_IDLE;
			}

		}

		if(B_4ms)		// 4ms时隙
		{
			B_4ms = 0;

			if(++cnt_500ms == 125)
			{
				cnt_500ms = 0;
				B_500ms   = 1;	//500ms时隙标志
			}

			if(TimeOut != 0)
			{
				if(--TimeOut == 0)	//堵转超时
				{
//					PWMA_IER  = 0;	//禁止PWMA中断
//					PWM_Value = 0;
//					CMPCR1 &= ~(0x40+0x30);	// 软件清除中断标志位, 禁止比较器上升沿、下降沿中断中断
//					PWMA_CCR1 = 0;
//					PWMA_CCR2 = 0;
//					PWMA_CCR3 = 0;
//					U_PWM2P=0;	V_PWM3P=0;	W_PWM4P=0;
//					U_PWM2N=0;	V_PWM3N=0;	W_PWM4N=0;
//					delay_ms(250);	//堵转时,延时一点时间再启动
//					run_mode = MOTOR_IDLE;
				}
			}

			if (run_mode == MOTOR_IDLE)	//如果是停机模式，则做ADC
			{
				Sw_ADC10 = ((Sw_ADC10 *7)>>3) + Get_ADC10bitResult(10);	//低通滤波结果为13位,   7：ADC7(电位器)
			}

			j = Sw_ADC10;																					/*ADCC油门---Mori*/
			if(j != Sw_ADC10)	j = Sw_ADC10;
					//j = 800;			
			//PWW_Set  = j >> 3;	//油门是10位的																	/*ADCC油门---Mori*/
			PWW_Set  = 800;
		}

		if(B_500ms)	//500ms时隙
		{
			B_500ms = 0;

			// 计算每分钟转速	换相时间 PhaseTime = PhaseTimeSum / PhaseSumCnt,   转速 = 60*1000000/(6*PhaseTimeSum/PhaseSumCnt)/MPP = (10000000/MPP)*PhaseSumCnt/PhaseTimeSum
			if(run_mode == MOTOR_RUN)	RollSpeed = (u32)((10000000.0f/MPP) * PhaseSumCnt / PhaseTimeSum);	// 计算当前转速 = 60*1000000/(6*PhaseTimeSum/PhaseSumCnt)/MPP = (10000000/MPP)*PhaseSumCnt/PhaseTimeSum
			else						RollSpeed = 0;
			PhaseSumCnt  = 0;
			PhaseTimeSum = 0;
		}
	}
}

